app/Controllers/Admin.php

SELECT `users`.`id` as `userid`, `username`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function index()
    {
        $data['title'] = 'Dashboard';
        // $users = new \Myth\Auth\Models\UserModel();
        // $data['users'] = $users->findAll();



        $this->builder->select('users.id as userid, username, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $this->builder->get();

SELECT `users`.`id` as `userid`, `username`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
SELECT *
FROM `shop`
---
    public function shop()
    {
        $data['title'] = 'Shop';


        $this->builder->select('users.id as userid, username, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $this->builder->get();

        $shopModel = new ShopModel();
        $data['shops'] = $shopModel->findAll();

SELECT *
FROM `about`
WHERE `about`.`id` = 1
---

        // Ambil data dari database
        $aboutModel = new \App\Models\AboutModel();
        $aboutData = $aboutModel->find(1); // Mengambil data pada id 1, sesuaikan dengan struktur tabel

SELECT `checkoout`.*, `users`.`username`
FROM `checkoout`
JOIN `users` ON `users`.`id` = `checkoout`.`user_id`
---
    public function history()
    {
        $db = \Config\Database::connect(); // Menghubungkan ke database

        $query = $db->table('checkoout')
            ->select('checkoout.*, users.username')
            ->join('users', 'users.id = checkoout.user_id')
            ->get();

        $data['results'] = $query->getResult();

SELECT `checkoout`.`id` as `ids`, `users`.*, `checkoout`.*, `data_chart`.*
FROM `users`
JOIN `checkoout` ON `users`.`id` = `checkoout`.`user_id`
JOIN `data_chart` ON `checkoout`.`user_id` = `data_chart`.`user_id` AND `checkoout`.`tanggal` = `data_chart`.`date`
WHERE `checkoout`.`id` = '34'
AND checkoout.tanggal = data_chart.date
---
    public function generatePDF($user_id)
    {
        $db = \Config\Database::connect(); // Menghubungkan ke database
        $query = $db->table('users')
            ->join('checkoout', 'users.id = checkoout.user_id')
            ->join('data_chart', 'checkoout.user_id = data_chart.user_id AND checkoout.tanggal = data_chart.date')
            ->select('checkoout.id as ids, users.*, checkoout.*, data_chart.*')
            ->where('checkoout.id', $user_id)
            ->where('checkoout.tanggal', 'data_chart.date', false) // Compare the dates
            ->get();

        $data['results'] = $query->getResult();

SELECT `checkoout`.*, `users`.`username`
FROM `checkoout`
JOIN `users` ON `users`.`id` = `checkoout`.`user_id`
---
    public function status()
    {

        $model = new KaryawanModel();
        $data['karyawan'] = $model->getKaryawan();
        $db = \Config\Database::connect(); // Menghubungkan ke database

        $query = $db->table('checkoout')
            ->select('checkoout.*, users.username ')
            ->join('users', 'users.id = checkoout.user_id')
            ->get();