app/Controllers/Home.php

    public function index()
    {


        $config = new Custom();
        $expirationDate = $config->expirationDate; // Get the expiration date from the configuration file
        $currentDate = date('Y-m-d'); // Get the current date

        if ($currentDate >= $expirationDate) {

            return view('blank'); // Redirect to a blank or expired page
        }


        $productModel = new ShopModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `shop`

    public function shop()
    {
        $shopModel = new ShopModel();
        $data['products'] = $shopModel->findAll();
---
SELECT *
FROM `shop`