app/Controllers/Karyawans.php

SELECT `karyawan`, COUNT(*) AS jumlah
FROM `checkoout`
WHERE `karyawan` != '-'
GROUP BY `karyawan`
---
    public function index()
    {
        $db = db_connect();
        $model = new KaryawanModel();
        $data['karyawan'] = $model->getKaryawan();

        $query = $db->table('checkoout')
            ->select('karyawan, COUNT(*) AS jumlah')
            ->where('karyawan !=', '-')
            ->groupBy('karyawan')
            ->get();

SELECT `checkoout`.*, `data_chart`.*, `karyawan`.*, COUNT(*) AS jumlah
FROM `checkoout`
JOIN `data_chart` ON `checkoout`.`user_id` = `data_chart`.`user_id` AND `checkoout`.`tanggal` = `data_chart`.`date`
JOIN `karyawan` ON `checkoout`.`karyawan` = `karyawan`.`name`
WHERE checkoout.user_id = data_chart.user_id
AND checkoout.tanggal = data_chart.date
AND `checkoout`.`karyawan` != '-'
GROUP BY `checkoout`.`karyawan`
SELECT `karyawan`, COUNT(*) AS jumlah
FROM `checkoout`
WHERE `karyawan` != '-'
GROUP BY `karyawan`
SELECT `name_product`, SUM(quantity) AS total_quantity
FROM `data_chart`
WHERE `date` IS NULL
GROUP BY `name_product`
---
    public function data()
    {
        $db = db_connect();

        $query = $db->table('checkoout')
            ->select('checkoout.*, data_chart.*, karyawan.*')
            ->join('data_chart', 'checkoout.user_id = data_chart.user_id AND checkoout.tanggal = data_chart.date')
            ->join('karyawan', 'checkoout.karyawan = karyawan.name')
            ->where('checkoout.user_id', 'data_chart.user_id', false)
            ->where('checkoout.tanggal', 'data_chart.date', false)
            ->get();

        $data = $query->getResult();

        $query = $db->table('checkoout')
            ->select('karyawan, COUNT(*) AS jumlah')
            ->where('karyawan !=', '-')
            ->groupBy('karyawan')
            ->get();

        $datas = $query->getResult();

        $query = $db->table('data_chart')
            ->select('data_chart.name_product, SUM(data_chart.quantity) AS total_quantity')
            ->join('checkoout', 'data_chart.user_id = checkoout.user_id AND data_chart.date = checkoout.tanggal')
            ->groupBy('data_chart.name_product')
            ->where('checkoout.tanggal', 'data_chart.date', false)
            ->get();

        $data2 = $query->getResult();

SELECT `checkoout`.*, `data_chart`.*, `karyawan`.*
FROM `checkoout`
JOIN `data_chart` ON `checkoout`.`user_id` = `data_chart`.`user_id` AND `checkoout`.`tanggal` = `data_chart`.`date`
JOIN `karyawan` ON `checkoout`.`karyawan` = `karyawan`.`name`
WHERE checkoout.user_id = data_chart.user_id
AND checkoout.tanggal = data_chart.date
SELECT `karyawan`, COUNT(*) AS jumlah
FROM `checkoout`
WHERE `karyawan` != '-'
GROUP BY `karyawan`
SELECT `data_chart`.`name_product`, SUM(data_chart.quantity) AS total_quantity
FROM `data_chart`
JOIN `checkoout` ON `data_chart`.`user_id` = `checkoout`.`user_id` AND `data_chart`.`date` = `checkoout`.`tanggal`
WHERE checkoout.tanggal = data_chart.date
GROUP BY `data_chart`.`name_product`
---
    public function generatePDF()
    {
        $db = db_connect();
        // Menjalankan query pertama
        $query1 = $db->table('checkoout')
            ->select('checkoout.*, data_chart.*, karyawan.*')
            ->join('data_chart', 'checkoout.user_id = data_chart.user_id AND checkoout.tanggal = data_chart.date')
            ->join('karyawan', 'checkoout.karyawan = karyawan.name')
            ->where('checkoout.user_id', 'data_chart.user_id', false)
            ->where('checkoout.tanggal', 'data_chart.date', false)
            ->get();
        $data = $query1->getResult();

        // Menjalankan query kedua
        $query2 = $db->table('checkoout')
            ->select('karyawan, COUNT(*) AS jumlah')
            ->where('karyawan !=', '-')
            ->groupBy('karyawan')
            ->get();
        $datas = $query2->getResult();

        // Menjalankan query ketiga
        $query3 = $db->table('data_chart')
            ->select('data_chart.name_product, SUM(data_chart.quantity) AS total_quantity')
            ->join('checkoout', 'data_chart.user_id = checkoout.user_id AND data_chart.date = checkoout.tanggal')
            ->groupBy('data_chart.name_product')
            ->where('checkoout.tanggal', 'data_chart.date', false)
            ->get();