app/Controllers/User.php

    public function history()
    {
        $db = \Config\Database::connect(); // Menghubungkan ke database

        $query = $db->table('users')
            ->join('checkoout', 'users.id = checkoout.user_id')
            ->join('data_chart', 'checkoout.user_id = data_chart.user_id AND checkoout.tanggal = data_chart.date')
            ->get();

        $data['results'] = $query->getResult(); // Mengambil hasil query
---
SELECT *
FROM `users`
JOIN `checkoout` ON `users`.`id` = `checkoout`.`user_id`
JOIN `data_chart` ON `checkoout`.`user_id` = `data_chart`.`user_id` AND `checkoout`.`tanggal` = `data_chart`.`date`