app/Models/KaryawanModel.php

    public function getKaryawan()
    {
        return $this->findAll();
---
SELECT *
FROM `karyawan`