app/Models/ShopModel.php

    public function getRevenueData()
    {
        return $this->findAll();
---
SELECT *
FROM `shop`